package b_operator;

public class ex_07이진논리 {

	public static void main(String[] args) {
		
		int a = 15;      //00000000 00000000 00000000 00001111
		
		int b = 10;     // 00000000 00000000 00000000 00001010
		
		int and = a & b; //00000000 00000000 00000000 00001010
		System.out.println("and =" + and);
		
		int or  = a | b; //00000000 00000000 00000000 00001111
		System.out.println("or =" + or);
		
		int xor = a ^ b; //00000000 00000000 00000000 00000101
		
		System.out.println("xor =" + xor );

		[이진수] 숫자 2개 : 0,1
		 *                 11010 = 1 * 2(4) + 1*2(3) + 0*2(2) + 1* 2(1) + 0*2(0)
		 *                       =1 * 16 + 1*8 +0*4+ 1*2+0*1
		 *                       =26
				
				
				
	}

}
/*
 * 논리연산자(이진=비트)
 *  
 *  
 *   A B       A & B  A | B   A ^ B 
  
 * -----------------------------------------
 *  0 0         0      0       0
 *  0 1         0      1       1
 *  1 0         0      1       1
 *  1 1         1      1       0
 * 
 *
 * 
*/
